# Виведення пояснення та умов задачі
ex_1 = """---------------------------------------------------------
Напишіть програму, яка знайде максимально можливе число,
яке можна отримати після видалення однієї цифри.
Перший рядок містить одне ціле число n (10 ≤ n ≤ 2025).
Виведіть у другому рядку максимально можливе число,1
яке можна отримати після видалення однієї цифри.
                                    
                                    ||| курс, Бритвич Олександр Володимирович (ПІБ)
---------------------------------------------------------"""

print(ex_1)


# Функція для знаходження максимально можливого числа
def find_max_num_after_del(num):
    max_num = 0
    str_num = str(num)
    length_of_num = len(str_num)

    # Перебираємо всі можливі варіанти чисел, які отримуються після видалення однієї цифри
    for i in range(length_of_num):
        current_num = int(str_num[:i] + str_num[i + 1:])
        max_num = max(max_num, current_num)

    print(max_num)


# Безкінечний цикл для введення
while True:
    try:
        # Зчитуємо введення від користувача як ціле число
        user_input = int(input("Введіть ціле число у проміжку 10 ≤ n ≤ 2025. Натисніть 0 для завершення програми. "))

        # Перевіряємо, чи введене число відповідає основній умові
        if 10 <= user_input <= 2025:
            # Викликаємо функцію для знаходження максимально можливого числа
            find_max_num_after_del(user_input)
        # Перевіряємо, чи користувач ввів 0 для завершення програми
        elif user_input == 0:
            print("------------------\nПрограма завершена")
            break
        # Перевіряємо, чи введене число не входить у заданий проміжок
        else:
            print("\nПомилка: введене число не входить у проміжок 10 ≤ n ≤ 2025\n")

    # Перехоплюємо помилку, якщо введене значення не є цілим числом
    except ValueError:
        print("\nБудь ласка, введіть ціле число\n")
